{
  "blocks": [
    {
      "id": "basic_info",
      "name": "기본 정보 추출",
      "description": "프로젝트의 기본 정보를 체계적으로 추출합니다",
      "role": "건축 프로젝트 분석 전문가로서 문서에서 핵심 정보를 정확하게 식별하고 추출하는 역할을 수행합니다",
      "instructions": "제공된 문서에서 건축 프로젝트의 기본 정보를 단계별로 분석하고 추출하여 구조화된 형태로 제시합니다",
      "steps": [
        "문서 스캔 및 정보 식별 - PDF 내용을 읽고 건축 프로젝트 관련 핵심 정보 식별",
        "정보 분류 및 정리 - 추출된 정보를 카테고리별로 분류하고 정확성 검증",
        "구조화된 정보 제시 - 명확하고 일관된 형식으로 정보 정리"
      ],
      "end_goal": "프로젝트의 핵심 기본 정보가 체계적으로 정리된 완전한 프로필을 제공하여 후속 분석의 기초 자료로 활용할 수 있도록 합니다",
      "narrowing": {
        "output_format": "구조화된 표와 서술형 설명을 포함한 보고서. AI가 정보의 특성에 맞게 최적의 형식을 선택할 수 있습니다.",
        "suggested_items": [
          "프로젝트명",
          "건축주",
          "대지위치",
          "건물용도",
          "주요 요구사항"
        ],
        "constraints": "문서에 명시되지 않은 정보는 '정보 없음'으로 표시하되, 전문가 지식과 맥락 분석을 통해 보완 가능한 정보는 추론하여 제시 가능",
        "quality_standards": "각 정보의 출처를 명시하고, AI가 프로젝트 특성에 맞게 적절한 깊이와 분량으로 분석. 창의적이고 통찰력 있는 해석을 장려."
      },
      "category": "기본 정보 & 요구사항"
    },
    {
      "id": "phase1_candidate_generation",
      "name": "후보지 자동 제안",
      "description": "삼척시 내에서 프로젝트 요구조건을 충족하거나 조정 가능한 후보지를 5-7개 도출하고 핵심 지표를 구조화합니다",
      "role": "도시 입지 분석 전문가로서 삼척시의 실제 지형, 교통, 도시 맥락을 고려해 후보지를 제안하는 역할을 수행합니다",
      "instructions": "고정 프로그램 사양과 Phase 1.1 결과를 기반으로 삼척시(및 인접 권역)에서 현실적으로 고려 가능한 후보지를 제안하고, 각 후보지의 좌표, 면적, 경사도, 접근성, 확장성 등을 정량 데이터로 정리합니다. 학생이 직접 검증해야 할 리스크도 명시하세요.",
      "steps": [
        "요구조건 재확인 - 면적, 경사도, 접근성, 우선순위 등 필수 조건 정리",
        "배경 조사 - 삼척시 행정구역, 관광·체육 인프라, 교통망, 지형 특성 파악",
        "후보지 1차 도출 - 요구조건 충족 여부에 따라 5-7개 후보지를 선정",
        "핵심 지표 산정 - 면적(㎡), 경사도(%), 도로 접근성(m), 기존 인프라, 확장 잠재력 등을 구조화",
        "JSON 정리 및 분석 메모 - 후보지 데이터를 JSON 배열로 제공하고, 선택 근거·리스크·추가 확인 사항을 정리"
      ],
      "end_goal": "후보지별 정량 지표와 선택 근거가 포함된 JSON 데이터와 분석 메모를 제공하여 Phase 1.2 평가 단계에 활용할 수 있도록 합니다",
      "narrowing": {
        "output_format": "후보지 개요 서문 + (선택) 비교 표 + `### 후보지 데이터 (JSON)` 코드 블록 + `### 분석 메모`",
        "json_fields": [
          "name",
          "lat",
          "lon",
          "area_m2",
          "slope_percent",
          "land_use",
          "road_distance_m",
          "existing_facilities",
          "expansion_potential",
          "notes"
        ],
        "constraints": "JSON 배열은 5-7개의 후보지를 포함하고, 각 후보지는 삼척시 및 인접 권역 내 실존 지명·좌표를 사용. 좌표는 십진수(lat, lon)로 표기하고, 수치는 단위(㎡, %, m)를 제거한 값으로 입력.",
        "quality_standards": "후보지별 강·약점을 2-3문장으로 설명하고, 학생이 검증해야 할 리스크나 추가 조사 항목을 `분석 메모` 섹션에 명시."
      },
      "category": "Phase 1 · 후보지 분석"
    },
    {
      "id": "phase1_candidate_evaluation",
      "name": "후보지 정량 평가 매트릭스",
      "description": "선택된 후보지들을 평가 기준과 가중치에 따라 정량적으로 평가하고 순위를 산정합니다",
      "role": "도시 개발 평가 전문가로서 다양한 후보지를 다기준 평가(MCDA) 방식으로 비교하고 최적 후보지를 제안합니다",
      "instructions": "제공된 후보지 데이터(면적, 경사도, 도로 접근성, 기존 시설, 확장 잠재력 등)와 평가 기준별 가중치를 활용하여 각 후보지의 점수를 계산하고, 종합 점수와 순위를 산출합니다. 계산 근거와 분석 코멘트를 포함한 평가 매트릭스를 작성합니다",
      "steps": [
        "데이터 검증 - 입력된 후보지 데이터의 면적, 경사도, 도로 거리 등이 요구사항 필터와 일치하는지 확인하고 이상치를 식별",
        "기준별 점수화 - 접근성, 연계성, 확장성, 경제성, 공공성 등 각 평가 기준에 대해 후보지별 점수를 0-100점 척도로 산정",
        "가중치 적용 및 종합 점수 계산 - 기준별 점수에 가중치를 적용하여 종합 점수를 계산하고 후보지별 순위를 결정",
        "결과 시각화 및 인사이트 도출 - 후보지별 점수 분포와 순위, 상위 후보지의 강점/약점, 근소한 차이 여부 등을 분석하여 코멘트 작성"
      ],
      "end_goal": "후보지별 정량 평가 점수와 순위가 명확히 제시되고, 상위 후보 선택을 위한 근거와 인사이트가 마련됩니다",
      "narrowing": {
        "output_format": "후보지 평가 매트릭스, 기준별 점수 요약, 총점 순위표, 평가 인사이트 코멘트를 포함한 종합 보고서. AI가 프로젝트 특성에 맞게 구조와 내용을 자유롭게 구성할 수 있습니다.",
        "criteria": [
          "접근성: 고속도로 IC/역/공항까지 거리, 도로 접근성",
          "연계성: 기존 체육/교육/관광 시설과의 연계 가능성",
          "확장성: 추가 부지 확보 가능성, 단계별 개발 여지",
          "경제성: 토지 비용, 공사 난이도(경사도 등)",
          "공공성: 주민 접근성, 개방형 프로그램 제공 가능성"
        ],
        "scoring_rules": [
          "도로 거리: 가까울수록 높은 점수",
          "기존 시설 수: 많을수록 높은 점수",
          "확장 잠재력: 우수/보통/제한적 기준으로 점수화",
          "경사도: 낮을수록 높은 점수",
          "면적: 요구 면적 대비 비율로 점수화"
        ],
        "constraints": "입력된 가중치를 그대로 적용하고, 점수 계산 근거를 표 하단에 설명. 동일 점수일 경우 접근성 또는 공공성 점수가 높은 후보지를 우선 고려",
        "quality_standards": "각 기준별 계산 방식과 결과를 명확히 설명 + 종합 점수 계산 과정 투명하게 제시 + 상위 3개 후보지에 대한 정성 코멘트 포함"
      },
      "category": "Phase 1 · 후보지 분석"
    },
    {
      "id": "phase1_facility_program",
      "name": "핵심 시설 리스트업",
      "description": "프로젝트 목표, 사용자 규모, 운영 제약을 반영해 반드시 갖춰야 할 시설과 우선순위를 목록화합니다",
      "category": "Phase 1 · 프로그램 설계",
      "role": "시설 요구 분석 전문가로서 문서에 제시된 요구조건을 바탕으로 필요한 시설군을 선별하고 근거를 제시합니다",
      "instructions": "제공된 프로젝트 요구조건과 이전 단계에서 도출된 인원·프로그램 정보를 검토해 필수/권장/선택 시설을 구분하고 리스트 형태로 제시하세요. 각 시설마다 설치 목적, 면적/수용 규모 기준, 우선순위, 근거를 함께 정리합니다.",
      "steps": [
        "요구조건 요약 - 사용자 수, 핵심 프로그램, 법적/공간 제약을 5줄 내외로 정리",
        "필수 시설 도출 - 프로젝트 목표 달성에 반드시 필요한 시설을 선정하고 근거 제시",
        "권장·보조 시설 분류 - 기능 강화나 이용자 경험 향상을 위한 시설을 권장/선택으로 분류"
      ],
      "end_goal": "필요 시설이 카테고리·우선순위별로 명확히 정리된 체크리스트를 제공해 설계·면적 산정 단계의 입력값으로 활용할 수 있게 합니다",
      "narrowing": {
        "output_format": "요구조건 요약, 필수/권장/선택 시설 리스트, 우선순위 및 구축 단계, 리스크/메모 섹션을 포함한 구조화된 보고서. AI가 프로젝트 특성에 맞게 최적의 형식과 구조를 자유롭게 선택할 수 있습니다.",
        "constraints": "문서 또는 이전 블록에서 확인된 데이터를 우선 사용하되, 전문가 지식과 추론을 통해 보완 가능. 추정이 필요한 경우 그 근거를 명시.",
        "quality_standards": "각 시설의 설치 목적과 근거를 명확히 제시하고, 프로젝트 목표 달성을 위한 창의적이고 실용적인 시설 제안을 포함. AI가 프로젝트 특성에 맞게 적절한 분량과 깊이로 분석."
      },
      "updated_at": "2026-01-21T14:42:47.280061",
      "created_by": "user",
      "created_at": "2026-01-21T14:42:47.280061"
    },
    {
      "id": "phase1_facility_area_reference",
      "name": "시설별 면적 기준 조사",
      "description": "각 시설 유형의 국내외 참고 사례를 조사하고 최소/권장/최대 면적 기준을 정리합니다",
      "role": "시설 벤치마킹 전문가로서 유사 사례의 면적, 프로그램 구성, 운영 스펙을 분석하여 기준을 제시합니다",
      "instructions": "시설별 면적 기준과 참고 사례를 조사하여 최소/권장/최대 면적 범위를 제시하고, 면적 산정 근거와 참고 사례를 설명합니다",
      "steps": [
        "사례 조사 - 국내외 유사 시설의 면적과 프로그램 구성 조사",
        "면적 범위 산정 - 최소/권장/최대 면적 범위 제시",
        "면적 산정 근거 설명 - 기준을 정한 이유와 참고 지표 설명",
        "위험 요소 및 주의사항 정리 - 면적 조정 시 고려사항 제시"
      ],
      "end_goal": "시설별 현실적인 면적 기준이 정리되고, 참고 사례와 근거를 기반으로 면적 산정의 신뢰성을 확보합니다",
      "narrowing": {
        "output_format": "서론, 면적 기준 테이블, 참고 사례, 면적 산정 근거, 위험 요소 및 주의사항을 포함한 종합 보고서. AI가 프로젝트 특성에 맞게 구조와 내용을 자유롭게 구성할 수 있습니다.",
        "constraints": "국제 규격과 국내 법규를 고려한 현실적 수치 사용. 모든 면적에 산정 근거를 명시하되, AI가 전문 지식과 추론을 통해 보완 가능.",
        "quality_standards": "각 시설별 최소/권장/최대 면적을 명확히 제시하고, 참고 사례와 면적 산정 근거를 상세히 설명. AI가 프로젝트 특성에 맞게 적절한 분량과 깊이로 분석하며, 창의적이고 실용적인 인사이트를 포함."
      },
      "category": "Phase 1 · 프로그램 설계"
    },
    {
      "id": "phase1_facility_area_calculation",
      "name": "시설별 면적 산정 보고서",
      "description": "선택된 시설 목록과 면적 기준을 바탕으로 총 면적과 단계별 개발 계획을 산정합니다",
      "role": "공간 계획 분석가로서 시설별 면적을 계산하고 총 개발 면적, 단계별 면적 배분, 여유부지를 산정합니다",
      "instructions": "시설별 수량과 면적 범위를 기반으로 총 면적을 계산하고, 기본/확장 시나리오에 따른 면적 계획과 단계별 개발 전략을 제시합니다",
      "steps": [
        "입력 값 검증 - 시설 수량과 면적 값 확인",
        "기준 시나리오 산정 - 권장 면적 기준으로 총 면적 계산",
        "대안 시나리오 제시 - 최소/최대 면적 기준 비교",
        "단계별 개발 계획 - 1·2·3단계 면적 배분 및 우선순위",
        "여유부지 및 확장 계획 제시"
      ],
      "end_goal": "시설별 면적이 합리적으로 산정되고 총 면적 및 단계별 개발 전략이 제시되어 마스터플랜 설계의 기초 자료가 됩니다",
      "narrowing": {
        "output_format": "서론, 면적 산정 요약표, 시나리오 비교표, 단계별 개발 계획표, 여유부지 및 확장 전략을 포함한 종합 보고서. AI가 프로젝트 특성에 맞게 구조와 내용을 자유롭게 구성할 수 있습니다.",
        "constraints": "입력된 수량과 면적 값을 기반으로 하되, AI가 전문 지식과 추론을 통해 계산 과정과 근거를 명확히 제시. 계산 공식과 논리를 투명하게 설명.",
        "quality_standards": "총 면적 계산 근거와 단계별 면적 배분 로직을 상세히 설명하고, 확장·유휴부지 활용 전략을 구체적으로 제시. AI가 프로젝트 특성에 맞게 적절한 분량과 깊이로 분석하며, 창의적이고 실용적인 인사이트를 포함."
      },
      "category": "Phase 1 · 프로그램 설계"
    },
    {
      "id": "requirements",
      "name": "건축 요구사항 분석",
      "description": "건축 관련 요구사항을 체계적으로 분석하고 정리합니다",
      "category": "기본 정보 & 요구사항",
      "role": "건축 설계 전문가로서 프로젝트의 모든 요구사항을 종합적으로 분석하고 우선순위를 설정하는 역할을 수행합니다",
      "instructions": "제공된 문서에서 건축 프로젝트의 모든 요구사항을 식별하고, 분류하며, 우선순위를 평가하여 설계 방향을 제시합니다",
      "steps": [
        "요구조건 요약 - 사용자 수, 핵심 프로그램, 법적/공간 제약을 5줄 내외로 정리",
        "필수 시설 도출 - 프로젝트 목표 달성에 반드시 필요한 시설을 선정하고 근거 제시",
        "권장·보조 시설 분류 - 기능 강화나 이용자 경험 향상을 위한 시설을 권장/선택으로 분류"
      ],
      "end_goal": "설계팀이 참고할 수 있는 완전하고 우선순위가 명확한 요구사항 목록을 제공하여 효율적인 설계 의사결정을 지원합니다",
      "narrowing": {
        "output_format": "서론, 요구사항 매트릭스, 우선순위 도표, 요구사항 상세 분석, 설계 방향 제안을 포함한 종합 보고서. AI가 프로젝트 특성에 맞게 구조와 내용을 자유롭게 구성할 수 있습니다.",
        "constraints": "문서에 명시되지 않은 요구사항은 '추정' 표시하되, 전문가 지식과 맥락 분석을 통해 보완 가능",
        "quality_standards": "각 요구사항의 문서 내 근거를 제시하고, 상세 분석과 설계 방향 제안을 포함. AI가 프로젝트 특성에 맞게 적절한 분량과 깊이로 분석하며, 창의적이고 실행 가능한 방안을 제시."
      },
      "updated_at": "2026-01-21T14:44:56.624549",
      "created_by": "user",
      "created_at": "2026-01-21T14:43:40.738395"
    },
    {
      "id": "phase1_requirements_structuring",
      "name": "요구사항 파싱 및 구조화",
      "description": "학생이 작성한 워크시트에서 핵심 요구사항과 제약조건을 파싱하여 구조화된 요약을 생성합니다",
      "role": "도시 개발 기획 전문가로서 학생이 작성한 요구사항 문서를 빠짐없이 파악하고 프로젝트의 핵심 요소를 구조화하는 역할을 수행합니다",
      "instructions": "제공된 요구사항 텍스트를 분석하여 정량적 요구사항, 핵심 목표, 주요 제약조건, 평가 우선순위를 분류하고 요약합니다",
      "steps": [
        "텍스트 정제 및 전처리 - 항목별 문장을 정리하고 중복된 표현을 통합",
        "정량적 요구사항 추출 - 수용 인원, 면적, 예산 등 수치형 정보를 파싱",
        "핵심 목표 요약 - 프로젝트의 비전과 성공 지표를 3-5개 항목으로 정리",
        "제약조건 분류 - 물리적, 경제적, 사회적, 환경적 제약을 구분하여 설명",
        "평가 항목 및 가중치 제안 - 요구사항에 기반한 평가 기준을 우선순위와 함께 제안"
      ],
      "end_goal": "Phase 1.1에서 활용할 수 있는 구조화된 요구사항 요약본을 제공하여 이후 데이터 수집 및 후보지 분석의 기준을 마련합니다",
      "narrowing": {
        "output_format": "주요 섹션별 헤더 + 불릿 리스트 + 가중치 표기(예: 30%) + 항목별 근거 설명(2-3문장) + 마지막에 '※ 팀 토론 후 조정 가능' 안내 포함",
        "required_sections": [
          "입지 특징 및 필수 조건",
          "정량적 요구사항",
          "핵심 목표",
          "주요 제약조건",
          "평가 우선순위 (제안)",
          "추가 참고 사항"
        ],
        "constraint_categories": [
          "물리적 제약",
          "경제적 제약",
          "사회적 제약",
          "환경적/운영 제약"
        ],
        "prioritization_guideline": "가중치는 합계 100%로 맞추고, 각 항목마다 평가 기준을 1-2문장으로 제시",
        "constraints": "학생이 입력한 텍스트 외의 정보는 생성하지 말고, 불확실한 내용은 '추가 확인 필요'로 표시",
        "quality_standards": "각 섹션마다 근거를 명시하고, 수치 데이터는 단위 변환(평↔㎡)이 필요하면 병기"
      },
      "category": "Phase 1 · 요구사항 정리"
    },
    {
      "id": "phase1_data_inventory",
      "name": "필요 데이터 목록 자동 생성",
      "description": "요구사항 요약을 기반으로 분석에 필요한 공간/통계 데이터를 우선순위별로 제안합니다",
      "role": "도시 데이터 컨설턴트로서 프로젝트 목표 달성을 위해 필요한 데이터를 식별하고 준비 상태를 추적하는 역할을 수행합니다",
      "instructions": "요구사항 구조화 결과를 검토하여 필수 데이터와 선택 데이터 목록을 작성하고, 각 항목에 파일 형식, 출처, 활용 목적, 업로드 상태를 표시합니다",
      "steps": [
        "요구사항 요약 검토 - 정량적 요구와 평가 기준을 파악하여 필수 조건 정리",
        "데이터-요구사항 매핑 - 각 요구/제약을 해결하기 위한 데이터 유형을 매칭",
        "우선순위 분류 - 필수/권장/선택 데이터를 나누고 준비 순서를 제안",
        "메타데이터 작성 - 파일 형식, 추천 출처, 활용 목적, 업로드 상태 기본값을 입력",
        "체크리스트 구성 - 학생이 업로드 진행 상황을 표시할 수 있도록 항목화"
      ],
      "end_goal": "학생이 Phase 1.1에서 어떤 데이터를 준비해야 하는지 명확히 이해하고 업로드 진행 상황을 추적할 수 있는 체크리스트를 제공합니다",
      "narrowing": {
        "output_format": "서론, 우선순위별 데이터 목록(필수/권장/선택), 추가 데이터 제안을 포함한 종합 보고서. AI가 프로젝트 특성에 맞게 구조와 내용을 자유롭게 구성할 수 있습니다.",
        "priority_buckets": [
          "1단계: 필수 데이터",
          "2단계: 권장 데이터",
          "3단계: 선택 데이터"
        ],
        "status_format": "업로드 상태 표기 (AI가 적절한 형식 선택 가능)",
        "recommended_sources": [
          "국가공간정보포털",
          "도시공간데이터포털",
          "국토정보플랫폼",
          "지역 통계포털",
          "기타 공공 데이터"
        ],
        "constraints": "요구사항 요약에 언급되지 않은 데이터도 AI가 전문 지식과 추론을 통해 제안 가능. 각 데이터의 필요 이유를 명확히 제시.",
        "quality_standards": "각 데이터 항목의 활용 목적과 요구사항과의 연계성을 구체적으로 서술하고, 형식과 추천 출처를 명시. AI가 프로젝트 특성에 맞게 적절한 분량과 깊이로 분석하며, 창의적이고 실용적인 데이터 제안을 포함."
      },
      "category": "Phase 1 · 요구사항 정리"
    },
    {
      "id": "design_suggestions",
      "name": "설계 제안",
      "description": "기본적인 설계 방향과 제안사항을 체계적으로 제공합니다",
      "role": "건축 설계 전문가로서 프로젝트의 현황을 분석하고 최적의 설계 방향을 제시하는 역할을 수행합니다",
      "instructions": "제공된 문서를 바탕으로 프로젝트의 현황을 분석하고, 설계 컨셉을 도출하며, 구체적인 설계 제안과 실행 계획을 수립합니다",
      "steps": [
        "현황 분석 - PDF 내용을 바탕으로 프로젝트의 현재 상황 파악",
        "설계 방향 도출 - 분석 결과를 바탕으로 설계 컨셉 방향 설정",
        "구체적 제안 - 공간 구성, 주요 설계 포인트, 주의사항 제안",
        "실행 계획 - 제안사항의 실행 가능성과 구체적 방안 제시"
      ],
      "end_goal": "프로젝트의 특성에 맞는 최적의 설계 방향과 실행 가능한 구체적 제안을 제공하여 설계팀의 의사결정을 지원합니다",
      "narrowing": {
        "output_format": "설계 제안서 형태의 구조화된 보고서. AI가 프로젝트 특성에 맞게 최적의 형식과 구조를 자유롭게 선택할 수 있습니다.",
        "suggested_sections": [
          "현황 분석",
          "설계 컨셉",
          "공간 구성안",
          "실행 계획"
        ],
        "design_focus": "기능성, 효율성, 지속가능성을 중점적으로 고려하되, AI가 프로젝트 특성에 맞게 추가 고려사항 제안 가능",
        "constraints": "문서에 명시된 제약조건과 법규를 준수하되, AI가 전문 지식과 추론을 통해 보완 가능",
        "quality_standards": "각 제안의 근거와 실행 가능성을 명확히 제시. AI가 프로젝트 특성에 맞게 적절한 분량과 깊이로 분석하며, 창의적이고 실용적인 설계 제안을 포함."
      },
      "category": "현황 분석 & 검증"
    },
    {
      "id": "accessibility_analysis",
      "name": "접근성 평가",
      "description": "대상지의 접근성을 종합적으로 평가하고 개선방안을 제시합니다",
      "role": "도시계획 및 접근성 전문가로서 대상지의 교통, 보행, 시설 접근성을 종합적으로 분석하는 역할을 수행합니다",
      "instructions": "제공된 문서를 바탕으로 대상지의 교통 접근성, 보행 접근성, 시설 접근성을 분석하고 종합적인 접근성 평가를 수행합니다",
      "steps": [
        "교통 접근성 분석 - 대중교통 정류장과의 거리 및 연결성, 도로망 접근성 평가",
        "보행 접근성 분석 - 보행자 동선 및 보도 연결성, 장애인 접근성 평가",
        "시설 접근성 분석 - 주변 주요 시설과의 거리 및 생활 편의시설 접근성 평가",
        "종합 평가 - 각 접근성 요소의 가중치를 고려한 종합 점수 산출 및 개선방안 제시"
      ],
      "end_goal": "대상지의 접근성 현황을 정확히 파악하고 개선이 필요한 영역과 우선순위를 제시하여 개발 방향을 제안합니다",
      "narrowing": {
        "output_format": "접근성 평가 보고서, 점수 매트릭스, 개선방안 로드맵을 포함한 종합 보고서. AI가 프로젝트 특성에 맞게 구조와 내용을 자유롭게 구성할 수 있습니다.",
        "evaluation_criteria": [
          "교통 접근성",
          "보행 접근성",
          "시설 접근성",
          "장애인 접근성"
        ],
        "scoring_system": "AI가 적절한 평가 척도와 방법을 선택하여 종합 점수 산출",
        "constraints": "문서에 명시된 정보와 일반적인 접근성 기준을 기반으로 하되, AI가 전문 지식과 추론을 통해 보완 가능",
        "quality_standards": "각 평가 기준과 점수 산출 근거를 명확히 제시. AI가 프로젝트 특성에 맞게 적절한 분량과 깊이로 분석하며, 창의적이고 실용적인 개선방안을 포함."
      },
      "category": "현황 분석 & 검증"
    },
    {
      "id": "zoning_verification",
      "name": "법규 검증",
      "description": "대상지의 용도지역 및 건축법규를 체계적으로 검증합니다",
      "role": "법무 및 건축법규 전문가로서 대상지의 법적 규제사항을 정확하게 검증하고 위험요소를 식별하는 역할을 수행합니다",
      "instructions": "제공된 문서를 바탕으로 대상지의 용도지역, 건축법규, 특별법 적용 여부를 검토하고 법적 위험요소를 분석합니다",
      "steps": [
        "용도지역 확인 - 대상지의 용도지역 분류 및 허용 용도, 건축 제한사항 분석",
        "건축법규 검토 - 용적률, 건폐율, 높이 제한 등 건축 제한 및 도시계획법상 제한사항 검토",
        "특별법 검토 - 문화재보호법, 환경보전법 등 특별법 적용 여부 및 특별지역 여부 확인",
        "위험요소 분석 - 법규 위반 가능성 및 리스크 요소 식별, 대안 및 해결방안 제시"
      ],
      "end_goal": "대상지 개발 시 발생할 수 있는 모든 법적 리스크를 사전에 식별하고 대응방안을 제시하여 프로젝트의 법적 안정성을 확보합니다",
      "narrowing": {
        "output_format": "법규 검증 보고서, 위험요소 매트릭스, 대응방안 가이드를 포함한 종합 보고서. AI가 프로젝트 특성에 맞게 구조와 내용을 자유롭게 구성할 수 있습니다.",
        "verification_scope": [
          "용도지역",
          "건축법규",
          "특별법",
          "개발제한구역"
        ],
        "risk_assessment": "AI가 적절한 위험도 분류 체계를 선택하여 리스크 요소 분석",
        "constraints": "현재 시점의 법령 기준으로 검증하되, 법령 변경 가능성과 전문 지식을 고려하여 보완 가능",
        "quality_standards": "각 법규 조항과 검증 근거를 명확히 제시. AI가 프로젝트 특성에 맞게 적절한 분량과 깊이로 분석하며, 창의적이고 실용적인 대응방안을 포함."
      },
      "category": "현황 분석 & 검증"
    },
    {
      "id": "capacity_estimation",
      "name": "수용력 추정",
      "description": "대상지의 개발 수용력을 체계적으로 추정하고 최적 개발 규모를 제안합니다",
      "role": "개발계획 전문가로서 대상지의 물리적, 법적, 사회적, 경제적 수용력을 종합적으로 분석하는 역할을 수행합니다",
      "instructions": "제공된 문서를 바탕으로 대상지의 다양한 수용력 요소를 분석하고 최적의 개발 규모와 단계별 개발 방안을 제시합니다",
      "steps": [
        "물리적 수용력 분석 - 대지면적 및 건축 가능 면적 계산, 물리적 제약요소 분석",
        "법적 수용력 분석 - 용적률, 건폐율 등 법적 제한에 따른 최대 건축 규모 추정",
        "사회적 수용력 분석 - 주변 인구밀도 및 수요 분석, 지역사회 수용성 평가",
        "경제적 수용력 분석 - 개발비용 대비 수익성 분석, 시장 수요 및 공급 상황 고려",
        "종합 수용력 평가 - 각 요소를 종합한 최적 개발 규모 제안 및 단계별 개발 방안 제시"
      ],
      "end_goal": "대상지의 최적 개발 규모를 제안하고 단계별 개발 전략을 수립하여 개발사업의 성공 가능성을 높입니다",
      "narrowing": {
        "output_format": "수용력 분석 보고서, 개발 규모 추정표, 단계별 개발 로드맵을 포함한 종합 보고서. AI가 프로젝트 특성에 맞게 구조와 내용을 자유롭게 구성할 수 있습니다.",
        "analysis_areas": [
          "물리적 수용력",
          "법적 수용력",
          "사회적 수용력",
          "경제적 수용력"
        ],
        "calculation_method": "각 수용력 요소별 정량적 분석 후 종합 평가. AI가 적절한 분석 방법과 평가 기준을 선택 가능.",
        "constraints": "문서에 명시된 정보와 일반적인 개발 기준을 기반으로 하되, AI가 전문 지식과 추론을 통해 보완 가능",
        "quality_standards": "각 수용력 계산 과정과 근거를 명확히 제시. AI가 프로젝트 특성에 맞게 적절한 분량과 깊이로 분석하며, 창의적이고 실용적인 개발 전략을 포함."
      },
      "category": "현황 분석 & 검증"
    },
    {
      "id": "feasibility_analysis",
      "name": "사업성 개략 평가",
      "description": "대상지의 사업성을 종합적으로 평가하고 투자 의사결정을 지원합니다",
      "role": "사업성 분석 전문가로서 프로젝트의 시장성, 수익성, 위험성을 종합적으로 평가하고 투자 결정을 지원하는 역할을 수행합니다",
      "instructions": "제공된 문서를 바탕으로 프로젝트의 시장성, 수익성, 위험성, 자금 조달 가능성을 분석하고 종합적인 사업성 평가를 수행합니다",
      "steps": [
        "시장성 분석 - 지역 시장 규모 및 성장 잠재력, 경쟁사 현황 및 차별화 요소 분석",
        "수익성 분석 - 예상 매출 및 운영비용 추정, 투자회수기간 및 수익률 계산",
        "위험성 분석 - 시장, 법적, 기술적 위험 요소 식별 및 발생 가능성, 영향도 평가",
        "자금 조달 분석 - 필요 자금 규모 및 조달 방안 검토, 자금 조달 가능성 및 조건 분석",
        "종합 평가 - 사업성 종합 점수 산출, Go/No-Go 결정 및 개선 방안 제시"
      ],
      "end_goal": "투자자와 의사결정권자가 참고할 수 있는 종합적이고 객관적인 사업성 평가 결과를 제공하여 투자 결정을 지원합니다",
      "narrowing": {
        "output_format": "사업성 평가 보고서, 재무 분석표, 위험도 매트릭스, 투자 권고안을 포함한 종합 보고서. AI가 프로젝트 특성에 맞게 구조와 내용을 자유롭게 구성할 수 있습니다.",
        "evaluation_criteria": [
          "시장성",
          "수익성",
          "위험성",
          "자금 조달성"
        ],
        "scoring_system": "AI가 적절한 평가 척도와 방법을 선택하여 종합 점수 산출",
        "constraints": "문서에 명시된 정보와 일반적인 사업성 평가 기준을 기반으로 하되, AI가 전문 지식과 추론을 통해 보완 가능",
        "quality_standards": "모든 분석 과정과 근거를 명확히 제시하고 보수적 관점에서 평가. AI가 프로젝트 특성에 맞게 적절한 분량과 깊이로 분석하며, 창의적이고 실용적인 투자 권고안을 포함."
      },
      "category": "사업성 & 운영 전략"
    },
    {
      "id": "site_selection_analysis",
      "name": "입지 선정 분석",
      "description": "GIS 공간 데이터를 기반으로 최적 입지를 선정하고 후보지를 평가합니다",
      "role": "도시계획 및 GIS 전문가로서 공간 데이터를 분석하여 프로젝트에 최적화된 입지를 선정합니다",
      "instructions": "제공된 공간 데이터(행정구역, 토지소유정보, 공시지가 등)와 프로젝트 요구사항을 종합하여 최적 입지 후보를 도출하고 평가합니다",
      "steps": [
        "공간 데이터 분석 - 업로드된 Shapefile의 행정구역, 토지 현황, 공시지가 정보 분석",
        "입지 조건 매칭 - 프로젝트 요구사항(면적, 접근성, 용도지역 등)과 실제 공간 데이터 교차 분석",
        "후보지 도출 - 조건에 부합하는 3-5개 후보지 선정 및 좌표 제시",
        "다기준 평가 매트릭스 생성 - 각 후보지별 평가 기준 적용 및 정량적 지표 계산 (거리, 면적, 비용)",
        "가중치 기반 종합 평가 - 각 평가 기준별 가중치를 적용한 종합 점수 산출",
        "정성적 평가 - 각 후보지의 경관, 확장성, 시너지 효과 등 정성적 요소 평가",
        "비교 평가 - 각 후보지의 장단점, 개발 가능성, 비용 추정을 표로 정리",
        "최종 추천 - 종합 평가 결과를 바탕으로 최적 입지 1-2곳 추천"
      ],
      "end_goal": "실제 GIS 데이터를 근거로 프로젝트에 최적화된 입지를 선정하고, 다기준 평가 매트릭스와 가중치 기반 종합 평가를 통해 데이터 기반의 명확한 선정 근거를 제시합니다",
      "narrowing": {
        "output_format": "입지 분석 보고서, 다기준 평가 매트릭스표(가중치 포함), 후보지 비교표, 종합 점수표, 좌표 정보, 지도 시각화 안내를 포함한 종합 보고서. AI가 프로젝트 특성에 맞게 구조와 내용을 자유롭게 구성할 수 있습니다.",
        "evaluation_criteria": [
          "접근성 (30%) - 고속도로 IC, 역, 공항 거리",
          "연계성 (25%) - 기존 체육시설, 교육시설 근접성",
          "확장성 (20%) - 단계적 개발 가능성",
          "경제성 (15%) - 토지비용, 개발비용",
          "공공성 (10%) - 주민 접근성, 개방 가능성"
        ],
        "evaluation_method": "정량적 지표 계산 (거리, 면적, 비용) + 정성적 평가 (경관, 확장성, 시너지) + 가중치 적용 종합 점수",
        "weighted_scoring": "각 평가 기준별 가중치(%)를 적용하여 종합 점수 산출 (예: 접근성 30%, 연계성 25%, 확장성 20%, 경제성 15%, 공공성 10%)",
        "output_coordinates": "추천 후보지의 위경도 좌표를 반드시 명시",
        "constraints": "실제 Shapefile 데이터에 존재하는 필지/구역만 후보로 선정",
        "quality_standards": "모든 분석 근거를 Shapefile의 실제 데이터로 제시하고, 후보지별 정량적 비교와 가중치 기반 종합 점수 산출 과정을 명시. 좌표 정보를 포함하며, AI가 프로젝트 특성에 맞게 적절한 분량과 깊이로 분석."
      },
      "category": "Phase 1 · 후보지 분석"
    },
    {
      "id": "masterplan_scenario_generation",
      "name": "마스터플랜 시나리오 생성",
      "description": "다양한 사용자 그룹을 위한 시간대별 최적 공간 활용 시나리오를 생성하고 마스터플랜을 작성합니다",
      "role": "도시계획 및 공간 설계 전문가로서 다양한 사용자 그룹(엘리트 선수, 유망주, 감독/코치, 지역주민, 생활체육 이용자 등)의 패턴을 분석하여 시간대별 최적 공간 활용 시나리오를 설계합니다",
      "instructions": "제공된 문서와 사용자 데이터를 바탕으로 다양한 사용자 그룹의 활동 패턴을 분석하고, 시간대별 최적 공간 활용 시나리오를 생성하여 통합 마스터플랜을 수립합니다",
      "steps": [
        "사용자 그룹 분석 - 엘리트 선수, 유망주, 감독/코치, 지역주민, 생활체육 이용자 등의 활동 패턴 및 요구사항 분석",
        "시간대별 활동 패턴 분석 - 오전(전문훈련), 오후(재활치료), 저녁(생활체육) 등 시간대별 주요 활동 식별",
        "시설 이용률 시뮬레이션 - 각 시설(테니스 코트, 체육관, 재활센터, 컨벤션홀)의 24시간 이용률 시뮬레이션 및 피크 타임 혼잡도 예측",
        "유휴 공간 활용 방안 - 각 시간대별 유휴 공간 식별 및 활용 방안 제시",
        "공간 전환 메커니즘 설계 - 시간대별 공간 용도 전환 방안 및 유연한 공간 활용 구조 제시",
        "공간 활용 시나리오 생성 - 각 시간대별 최적 공간 배치 및 사용자 그룹별 공간 활용 시나리오 3-5개 생성",
        "시나리오 비교 평가 - 각 시나리오의 효율성, 유연성, 수익성, 지역사회 기여도 비교 분석",
        "통합 마스터플랜 작성 - 최적 시나리오 기반 핵심 시설 배치, 공간 환경 기획, 주요 이용 방식 정리"
      ],
      "end_goal": "다양한 사용자 그룹이 유연하게 활용할 수 있는 핵심 시설과 공간환경을 기획하고, 시간대별 최적 공간 활용 방안과 공간 전환 메커니즘을 제시하여 마스터플랜 초안을 완성합니다",
      "narrowing": {
        "output_format": "마스터플랜 보고서, 시간대별 활동 패턴표, 시설 이용률 시뮬레이션표, 피크 타임 혼잡도 분석표, 유휴 공간 활용 방안표, 공간 전환 메커니즘표, 공간 활용 시나리오 비교표, 핵심 시설 배치도, 주요 이용 방식 스토리보드를 포함한 종합 보고서. AI가 프로젝트 특성에 맞게 구조와 내용을 자유롭게 구성할 수 있습니다.",
        "user_groups": [
          "엘리트 선수",
          "스포츠 유망주",
          "감독/코치",
          "지역주민",
          "생활체육 이용자",
          "단순 소비자"
        ],
        "time_periods": [
          "오전 6-9시: 전문 선수 훈련",
          "오전 9-12시: 학생 수업 + 일반 훈련",
          "오후 12-6시: 재활치료/교육/훈련",
          "저녁 6-9시: 생활 체육 + 주민 개방",
          "저녁 9-12시: 시설 유지관리/야간 자율학습"
        ],
        "facilities": [
          "테니스 코트 (실내 8면, 실외 12면)",
          "체육관 (배드민턴 10면 겸용)",
          "재활센터",
          "컨벤션홀"
        ],
        "scenario_criteria": [
          "효율성 (공간 활용도)",
          "유연성 (다양한 사용자 대응)",
          "수익성 (운영 수익 창출)",
          "지역사회 기여도"
        ],
        "constraints": "제공된 시설 규모와 프로그램 구성에 맞춰 현실적인 시나리오 생성",
        "quality_standards": "각 사용자 그룹별 구체적 활동 패턴을 제시하고, 시간대별 상세 시나리오와 시설 이용률 시뮬레이션을 정량적으로 제시. 공간 전환 메커니즘을 구체적으로 설명하고, 시나리오별 정량적 비교를 포함. AI가 프로젝트 특성에 맞게 적절한 분량과 깊이로 분석."
      },
      "category": "Phase 1 · 프로그램 설계"
    },
    {
      "id": "business_model_development",
      "name": "비즈니스 모델 구축",
      "description": "지역 경제 성장과 연동하는 지속가능한 체육교육 커뮤니티 및 수익 창출형 운영 모델을 디자인합니다",
      "role": "비즈니스 모델 및 지역경제 전문가로서 스포츠아카데미가 지역 경제 성장의 핵심 동력이 되도록 연관 산업을 발굴하고 지속가능한 운영 모델을 설계합니다",
      "instructions": "제공된 문서와 지역 산업 데이터를 바탕으로 스포츠아카데미와 시너지를 낼 수 있는 연관 산업을 발굴하고, 지역 경제 성장과 연동하는 지속가능한 비즈니스 모델을 설계합니다",
      "steps": [
        "지역 산업 분석 - 지역 산업 구조, 강점, 약점, 기회요소 분석 및 스포츠 산업과의 연계 가능성 평가",
        "글로벌 스포츠 시장 트렌드 분석 - 스포츠 재활 관광, IP 사업, 데이터 분석 컨설팅 등 글로벌 트렌드 분석",
        "연관 산업 발굴 - 지역 산업 데이터와 글로벌 트렌드를 교차 분석하여 시너지 산업 3-5개 발굴",
        "가치사슬 매핑 - 각 연관 산업과 아카데미 간의 가치사슬 관계를 분석하고 연계 방식을 구체화",
        "클러스터 효과 분석 - 연관 산업 클러스터 형성 시 예상되는 시너지 효과와 일자리 창출 효과 분석",
        "1차/2차/3차 산업 분류 - 직접 연계 산업(1차), 간접 연계 산업(2차), 유발 효과 산업(3차)으로 체계적 분류",
        "예상 이용자 분석 - 주요 타겟 그룹(엘리트 선수, 유망주, 지역주민, 관광객 등)의 이용 패턴 및 지불 의향 분석",
        "비즈니스 모델 설계 - 수익 구조, 운영 전략, 공간 계획, 서비스 운영 전략을 포함한 종합 비즈니스 모델 2-3개 설계",
        "최종 모델 선정 - 각 모델의 수익성, 지속가능성, 지역 기여도를 비교하여 최적 모델 선정 및 구체화"
      ],
      "end_goal": "지역 경제 성장과 연동하는 지속가능한 체육교육 커뮤니티와 수익 창출형 운영 모델을 설계하고, 연관 산업의 가치사슬과 클러스터 효과를 분석하여 스포츠아카데미가 지역 브랜딩과 경제 발전의 핵심 동력이 되도록 합니다",
      "narrowing": {
        "output_format": "비즈니스 모델 보고서, 연관 산업 발굴표(1차/2차/3차 분류), 가치사슬 매핑표, 클러스터 효과 분석표, 예상 이용자 분석표, 수익 구조 비교표, 운영 전략 로드맵, 공간 계획 및 서비스 운영 전략을 포함한 종합 보고서. AI가 프로젝트 특성에 맞게 구조와 내용을 자유롭게 구성할 수 있습니다.",
        "associated_industries": [
          "스포츠 재활 관광",
          "IP 사업 (브랜드, 콘텐츠)",
          "데이터 분석 컨설팅",
          "교육테크",
          "웰니스/요양 산업",
          "스포츠 이벤트/컨벤션"
        ],
        "industry_classification": [
          "1차 산업 (직접 연계): 스포츠 용품 제조/유통, 스포츠 과학 R&D, 재활 의료 서비스",
          "2차 산업 (간접 연계): 교육 테크놀로지, 미디어/콘텐츠 제작, 헬스케어 관광",
          "3차 산업 (유발 효과): 숙박/외식업, 교통/물류, 문화/엔터테인먼트"
        ],
        "revenue_streams": [
          "교육/훈련 수익",
          "시설 이용료",
          "컨벤션/호텔 수익",
          "재활/웰니스 서비스",
          "IP/브랜드 라이선스",
          "데이터/컨설팅 수익"
        ],
        "evaluation_criteria": [
          "수익성 (매출, 순이익)",
          "지속가능성 (장기 운영 가능성)",
          "지역 기여도 (일자리, 관광, 브랜딩)",
          "확장 가능성"
        ],
        "constraints": "제공된 시설 규모와 프로그램 구성에 맞춰 현실적인 수익 모델 설계",
        "quality_standards": "각 연관 산업별 구체적 연계 방안을 제시하고, 가치사슬 매핑과 클러스터 효과를 정량적으로 평가. 1차/2차/3차 산업 분류를 체계적으로 제시하고, 수익 구조와 운영 전략을 상세히 분석. AI가 프로젝트 특성에 맞게 적절한 분량과 깊이로 분석."
      },
      "category": "사업성 & 운영 전략"
    },
    {
      "id": "project_requirements_parsing",
      "name": "프로젝트 요구사항 파싱",
      "description": "학생의 초기 질문이나 목표를 분석하여 프로젝트 제약조건, 핵심 키워드, 분석 범위를 추출하고 부지 선정 기준을 정립합니다",
      "role": "프로젝트 기획 전문가로서 초기 요구사항을 체계적으로 분석하고 구조화된 기준을 제시하는 역할을 수행합니다",
      "instructions": "제공된 초기 질문 또는 목표를 분석하여 프로젝트의 제약조건(규모, 예산, 우선순위), 핵심 키워드(접근성, 연계성, 공공성 등), 분석 범위를 추출하고 부지 선정 기준을 정립합니다",
      "steps": [
        "프로젝트 제약조건 추출 - 규모, 예산, 우선순위 등 명시적/암시적 제약사항 식별 및 정리",
        "핵심 키워드 식별 - 접근성, 연계성, 공공성 등 프로젝트의 핵심 가치 키워드 추출",
        "분석 범위 설정 - 삼척시 전체 vs 특정 구역 등 분석 범위 결정",
        "부지 선정 기준 정립 - 각 기준별 가중치와 평가 지표를 포함한 종합 선정 기준 제시"
      ],
      "end_goal": "프로젝트의 핵심 요구사항과 제약조건이 명확히 정리되고, 부지 선정을 위한 구체적이고 평가 가능한 기준이 제시되어 후속 분석의 기초가 마련됩니다",
      "narrowing": {
        "output_format": "프로젝트 요구사항 분석 보고서, 제약조건 표, 핵심 키워드 분석표, 부지 선정 기준표(가중치 포함)를 포함한 종합 보고서. AI가 프로젝트 특성에 맞게 구조와 내용을 자유롭게 구성할 수 있습니다.",
        "required_items": [
          "프로젝트 규모 (면적, 용도 등)",
          "예산 범위",
          "우선순위 (핵심 고려사항)",
          "핵심 키워드",
          "제약사항 (지형, 법규, 기존 시설)",
          "분석 범위",
          "부지 선정 기준 및 가중치"
        ],
        "evaluation_criteria": [
          "접근성 (고속도로 IC, 역, 공항 거리)",
          "연계성 (기존 체육시설, 교육시설 근접성)",
          "확장성 (단계적 개발 가능성)",
          "경제성 (토지비용, 개발비용)",
          "공공성 (주민 접근성, 개방 가능성)"
        ],
        "constraints": "문서나 입력에 명시되지 않은 정보는 추측하지 말고 '정보 없음' 또는 '추가 확인 필요'로 표시",
        "quality_standards": "각 기준별 가중치와 평가 지표를 명확히 제시. AI가 프로젝트 특성에 맞게 적절한 분량과 깊이로 분석하며, 창의적이고 실용적인 기준 제안을 포함."
      },
      "category": "기본 정보 & 요구사항"
    },
    {
      "id": "essential_gis_data_analysis",
      "name": "필수 GIS 데이터 분석",
      "description": "부지 선정을 위해 필요한 GIS 데이터 레이어를 우선순위별로 분석하고 각 데이터의 분석 목적을 제시합니다",
      "role": "GIS 데이터 전문가로서 부지 선정에 필요한 공간 데이터를 체계적으로 분석하고 우선순위를 제시하는 역할을 수행합니다",
      "instructions": "프로젝트 요구사항과 부지 선정 기준을 바탕으로 필요한 GIS 데이터 레이어를 식별하고, 각 데이터의 분석 목적을 명확히 하며, 우선순위별로 정리합니다",
      "steps": [
        "필수 데이터 레이어 식별 - 지형, 토지이용, 도로망, 법규, 접근성, 인구/경제 데이터 등 필요한 레이어 식별",
        "각 데이터의 분석 목적 명확화 - 각 GIS 데이터 레이어가 부지 선정에 어떤 역할을 하는지 구체적으로 설명",
        "우선순위 설정 - 부지 선정에 필수적인 데이터부터 보조적인 데이터까지 우선순위별로 분류",
        "데이터 수집 방안 제시 - 각 데이터의 출처(도시공간데이터포털 등)와 수집 방법 안내"
      ],
      "end_goal": "부지 선정에 필요한 모든 GIS 데이터 레이어가 우선순위별로 정리되고, 각 데이터의 분석 목적이 명확히 제시되어 체계적인 데이터 수집이 가능하도록 합니다",
      "narrowing": {
        "output_format": "GIS 데이터 분석 보고서, 우선순위별 데이터 레이어 표, 각 데이터 분석 목적 설명표, 데이터 수집 방안 안내를 포함한 종합 보고서. AI가 프로젝트 특성에 맞게 구조와 내용을 자유롭게 구성할 수 있습니다.",
        "data_categories": [
          "GIS 데이터: 지형, 토지이용, 도로망",
          "법규 데이터: 교육발전특구, 용도지역",
          "접근성 데이터: 교통망, 관광지, 기존 시설",
          "인구/경제 데이터: 유동인구, 산업구조"
        ],
        "priority_levels": [
          "필수 (1순위): 부지 선정에 반드시 필요한 핵심 데이터",
          "중요 (2순위): 선정 정확도를 높이는 주요 데이터",
          "보조 (3순위): 추가 분석에 유용한 참고 데이터"
        ],
        "constraints": "실제 수집 가능한 데이터만 제시하고, 수집 불가능한 데이터는 대안 제시",
        "quality_standards": "각 데이터의 구체적 분석 목적과 활용 방안을 명확히 제시하고, 우선순위 근거와 데이터 출처를 명시. AI가 프로젝트 특성에 맞게 적절한 분량과 깊이로 분석."
      },
      "category": "Phase 1 · 후보지 분석"
    },
    {
      "id": "spatial_program_estimation",
      "name": "공간 프로그램 산정",
      "description": "선정된 부지와 프로젝트 요구사항을 바탕으로 시설별 필요 면적을 계산하고 기능별 그룹핑 및 배치 우선순위를 제시합니다",
      "role": "공간 계획 전문가로서 시설 프로그램을 체계적으로 산정하고 최적의 공간 배치 방안을 제시하는 역할을 수행합니다",
      "instructions": "선정된 부지 정보와 프로젝트 요구사항을 바탕으로 각 시설별 필요 면적을 계산하고, 기능별 그룹핑 및 배치 우선순위를 설정하며, 단계별 개발 시나리오를 수립합니다",
      "steps": [
        "시설별 필요 면적 계산 - 국제학교, 훈련시설, 재활센터, 호텔/컨벤션 등 각 시설의 규격과 필요 면적 산정",
        "기능별 그룹핑 - 교육시설, 훈련시설, 상업시설, 공공시설 등 기능별로 그룹핑",
        "배치 우선순위 설정 - 각 시설 그룹의 배치 우선순위와 인접성 요구사항 분석",
        "단계별 개발 시나리오 - 단계적 개발이 필요한 경우 각 단계별 시설 구성과 면적 제시"
      ],
      "end_goal": "시설별 필요 면적이 정확히 산정되고, 기능별 그룹핑과 배치 우선순위가 명확히 제시되어 마스터플랜 설계의 기초 자료가 마련됩니다",
      "narrowing": {
        "output_format": "공간 프로그램 산정 보고서, 시설별 면적 산정표, 기능별 그룹핑표, 배치 우선순위표, 단계별 개발 시나리오표를 포함한 종합 보고서. AI가 프로젝트 특성에 맞게 구조와 내용을 자유롭게 구성할 수 있습니다.",
        "facility_types": [
          "교육시설 (국제학교, 기숙사, 식당)",
          "훈련시설 (테니스, 양궁, 배드민턴, 펜싱)",
          "재활센터",
          "호텔/컨벤션",
          "주민 개방시설"
        ],
        "reference_cases": [
          "제주 국제학교",
          "서울체고",
          "IMG 아카데미",
          "국제 규격 경기장"
        ],
        "calculation_basis": [
          "국제학교 중/고등학교 각 학년 100명 규모 기준",
          "엘리트 훈련 시설 각 종목당 동시 훈련 가능 인원 50명 기준",
          "200실 규모 호텔 및 컨벤션 기준"
        ],
        "constraints": "실제 국제 규격과 국내 사례를 참고하여 현실적인 면적 산정",
        "quality_standards": "각 시설별 면적 산정 근거와 참고 사례를 명시하고, 기능별 그룹핑 이유와 배치 우선순위 근거를 제시. AI가 프로젝트 특성에 맞게 적절한 분량과 깊이로 분석."
      },
      "category": "Phase 1 · 프로그램 설계"
    },
    {
      "id": "persona_scenario_analysis",
      "name": "페르소나 시나리오 분석",
      "description": "엘리트 선수, 지역 주민, 관광객 등 다양한 사용자 유형별 특성을 분석하고 일과 시나리오를 생성합니다",
      "role": "사용자 경험 및 시나리오 기획 전문가로서 다양한 사용자 그룹의 특성과 활동 패턴을 분석하여 구체적인 일과 시나리오를 제시하는 역할을 수행합니다",
      "instructions": "제공된 사용자 유형별 특성을 바탕으로 각 페르소나의 일과를 시간대별로 분석하고, 주요 활동, 동선, 공간 활용 패턴을 시나리오로 제시합니다",
      "steps": [
        "페르소나 정의 - 엘리트 선수, 유망주, 지역주민, 관광객 등 주요 사용자 그룹 특성 정리",
        "시간대별 일과 분석 - 각 페르소나의 평일/주말 24시간 일정을 시간대별로 분석",
        "주요 활동 식별 - 학업, 훈련, 식사, 휴식, 재활 등 주요 활동과 필요한 공간 식별",
        "동선 및 공간 활용 시나리오 - 각 페르소나의 공간 이동 패턴과 시설 이용 시나리오 3가지 제시"
      ],
      "end_goal": "각 사용자 그룹의 특성과 일과 패턴이 명확히 정리되고, 구체적인 공간 활용 시나리오가 제시되어 마스터플랜 설계의 사용자 중심 기반이 마련됩니다",
      "narrowing": {
        "output_format": "페르소나 시나리오 분석 보고서, 페르소나 특성표, 시간대별 일과표, 주요 활동 분석표, 공간 활용 시나리오표를 포함한 종합 보고서. AI가 프로젝트 특성에 맞게 구조와 내용을 자유롭게 구성할 수 있습니다.",
        "persona_types": [
          "엘리트 선수 (17세 테니스 유망주)",
          "지역주민 (40대 생활체육 이용자)",
          "관광객/전지훈련팀",
          "해외 대학 스카우트"
        ],
        "time_breakdown": [
          "새벽 (6시-9시): 기상 및 아침 훈련",
          "오전 (9시-12시): 학교 수업 또는 전문 훈련",
          "오후 (12시-18시): 재활치료, 교육, 훈련",
          "저녁 (18시-22시): 생활체육, 문화활동",
          "야간 (22시-6시): 휴식 및 시설 유지관리"
        ],
        "constraints": "현실적이고 구체적인 일과 시나리오 제시",
        "quality_standards": "각 페르소나별 구체적 일과를 제시하고, 시간대별 상세 활동 분석과 공간 활용 시나리오를 포함. AI가 프로젝트 특성에 맞게 적절한 분량과 깊이로 분석하며, 창의적이고 실용적인 시나리오를 제안."
      },
      "category": "사용자 경험 & 스토리텔링"
    },
    {
      "id": "masterplan_layout_alternatives",
      "name": "마스터플랜 배치 대안",
      "description": "부지 형상과 프로그램 목록을 바탕으로 3-5개 배치 대안을 생성하고 각 대안의 장단점을 분석합니다",
      "role": "도시계획 및 마스터플랜 설계 전문가로서 다양한 배치 대안을 생성하고 최적의 조닝 전략을 제시하는 역할을 수행합니다",
      "instructions": "부지 형상과 프로그램 목록을 바탕으로 클러스터형, 선형 캠퍼스, 하이브리드 등 다양한 배치 대안을 생성하고, 각 대안의 조닝, 동선, 장단점을 분석하여 비교 평가합니다",
      "steps": [
        "배치 대안 생성 - 클러스터형, 선형 캠퍼스, 하이브리드 등 3-5개 배치 대안 생성",
        "조닝 전략 분석 - 각 대안별 기능별 그룹핑(조닝) 전략 설명",
        "동선 체계 분석 - 각 대안의 주요 동선과 연결성 평가",
        "장단점 비교 - 각 대안의 접근성, 확장성, 운영효율, 시너지 효과 비교 분석",
        "최종 추천 - 종합 평가를 바탕으로 최적 대안 1-2개 추천"
      ],
      "end_goal": "다양한 배치 대안이 생성되고 각 대안의 장단점이 명확히 비교되어 최적의 마스터플랜 배치 방향이 제시됩니다",
      "narrowing": {
        "output_format": "마스터플랜 배치 대안 보고서, 배치 대안 비교표, 조닝 다이어그램 설명, 동선 체계 분석표, 장단점 비교표, 최종 추천안을 포함한 종합 보고서. AI가 프로젝트 특성에 맞게 구조와 내용을 자유롭게 구성할 수 있습니다.",
        "layout_types": [
          "클러스터형 - 기능별 그룹핑",
          "선형 캠퍼스 - 중앙 축을 따라 배치",
          "하이브리드 - 교육과 상업 분리"
        ],
        "evaluation_criteria": [
          "접근성 (도로, 대중교통 연결)",
          "확장성 (단계적 개발 가능성)",
          "운영효율 (시설 관리 및 운영)",
          "시너지 효과 (시설 간 연계성)"
        ],
        "constraints": "부지 형상과 프로그램 규모에 맞춰 현실적인 배치 대안 제시",
        "quality_standards": "각 대안별 구체적 조닝 전략을 제시하고, 동선 체계를 상세히 설명하며 정량적 비교 분석을 포함. AI가 프로젝트 특성에 맞게 적절한 분량과 깊이로 분석."
      },
      "category": "Phase 1 · 프로그램 설계"
    },
    {
      "id": "storyboard_generation",
      "name": "스토리보드 생성",
      "description": "주요 이용 시나리오를 바탕으로 시간순 장면을 구성하고 카메라 앵글과 내레이션 스크립트를 제안합니다",
      "role": "영상 제작 및 스토리보드 전문가로서 주요 이용 시나리오를 시각적 스토리로 전환하는 역할을 수행합니다",
      "instructions": "주요 이용 시나리오를 바탕으로 시간순 장면을 구성하고, 각 장면의 카메라 앵글, 주요 보여줄 요소, 자막/내레이션을 포함한 스토리보드를 생성합니다",
      "steps": [
        "시나리오 선정 - 분석된 주요 이용 시나리오 1-3개 선정",
        "장면 구성 - 각 시나리오를 시간순 장면으로 분해",
        "카메라 앵글 제안 - 각 장면의 카메라 위치와 앵글 제안",
        "핵심 요소 식별 - 각 장면에서 보여줄 핵심 시설 및 활동 요소 식별",
        "내레이션 스크립트 작성 - 각 장면별 자막/내레이션 텍스트 작성"
      ],
      "end_goal": "주요 이용 시나리오가 시각적 스토리보드로 전환되어 영상 제작의 기초 자료가 마련됩니다",
      "narrowing": {
        "output_format": "스토리보드 보고서, 장면 구성표(장면 번호, 지속시간, 장소, 카메라 위치, 주요 요소, 자막/내레이션)를 포함한 종합 보고서. AI가 프로젝트 특성에 맞게 구조와 내용을 자유롭게 구성할 수 있습니다.",
        "scenario_types": [
          "엘리트 선수의 하루",
          "지역주민의 저녁 방문",
          "해외 스카우트 투어"
        ],
        "scene_elements": [
          "장면 번호",
          "지속시간",
          "장소 및 카메라 위치",
          "주요 보여줄 요소",
          "자막/내레이션 텍스트"
        ],
        "constraints": "60초 영상 기준으로 현실적인 장면 구성",
        "quality_standards": "각 장면별 구체적 설명을 제시하고, 카메라 앵글과 위치를 명시하며 내레이션 스크립트를 포함. AI가 프로젝트 특성에 맞게 적절한 분량과 깊이로 분석."
      },
      "category": "사용자 경험 & 스토리텔링"
    },
    {
      "id": "market_research_analysis",
      "name": "시장 조사 분석",
      "description": "목표 산업 분야의 글로벌 트렌드, 국내 시장 현황, 경쟁사 벤치마킹을 수행합니다",
      "role": "시장 조사 및 경쟁 분석 전문가로서 스포츠 산업의 시장 동향과 경쟁 환경을 체계적으로 분석하는 역할을 수행합니다",
      "instructions": "목표 산업 분야를 중심으로 글로벌 트렌드, 국내 시장 현황, 경쟁사 벤치마킹을 수행하고, 시장 기회와 위협 요소를 분석합니다",
      "steps": [
        "글로벌 트렌드 분석 - 스포츠 재활 관광, IP 사업 등 글로벌 시장 규모와 주요 트렌드 분석",
        "국내 시장 현황 분석 - 국내 스포츠 아카데미 시장 규모, 성장 가능성, 주요 플레이어 분석",
        "경쟁사 벤치마킹 - IMG 아카데미, 라파 나달 아카데미 등 주요 경쟁사 수익 모델 분석",
        "시장 기회 분석 - 아시아 시장 성장 가능성, 지역 특화 기회 요소 분석",
        "종합 평가 - 시장 진입 전략과 차별화 포인트 제시"
      ],
      "end_goal": "시장 환경과 경쟁 상황이 명확히 파악되고, 시장 기회와 차별화 전략이 제시되어 비즈니스 모델 설계의 기초가 마련됩니다",
      "narrowing": {
        "output_format": "시장 조사 분석 보고서, 글로벌 트렌드 분석표, 국내 시장 현황표, 경쟁사 벤치마킹표, 시장 기회 분석표를 포함한 종합 보고서. AI가 프로젝트 특성에 맞게 구조와 내용을 자유롭게 구성할 수 있습니다.",
        "market_areas": [
          "스포츠 재활 관광 산업",
          "스포츠 아카데미 교육",
          "엘리트 훈련 시설",
          "스포츠 IP 사업"
        ],
        "benchmark_targets": [
          "IMG 아카데미",
          "라파 나달 아카데미",
          "제주 국제학교",
          "서울체고"
        ],
        "analysis_focus": [
          "글로벌 시장 규모와 성장률",
          "주요 트렌드",
          "경쟁사 수익 모델",
          "아시아 시장 성장 가능성"
        ],
        "constraints": "최신 시장 데이터와 실제 사례를 기반으로 분석",
        "quality_standards": "각 시장 영역별 구체적 분석을 제시하고, 경쟁사 수익 모델을 상세히 분석하며 시장 기회를 정량적으로 평가. AI가 프로젝트 특성에 맞게 적절한 분량과 깊이로 분석."
      },
      "category": "사업성 & 운영 전략"
    },
    {
      "id": "revenue_model_design",
      "name": "수익 모델 설계",
      "description": "시설 현황과 목표 사용자를 바탕으로 다중 수익원 구조를 설계하고 재무 분석을 수행합니다",
      "role": "재무 분석 및 수익 모델 전문가로서 지속가능한 수익 구조를 설계하고 재무 분석을 수행하는 역할을 수행합니다",
      "instructions": "시설 현황과 목표 사용자를 바탕으로 학비, 기숙사비, 전지훈련, 호텔/컨벤션, 재활센터, 시설 대관, IP/라이선싱 등 다양한 수익원을 분석하고 재무 모델을 설계합니다",
      "steps": [
        "수익원 식별 - 학비, 기숙사비, 전지훈련, 호텔/컨벤션, 재활센터, 시설 대관, IP/라이선싱 등 수익원 식별",
        "수익원별 매출 추정 - 각 수익원의 현실적인 단가 및 이용률 추정, 계절별 변동성 고려",
        "비용 구조 분석 - 운영비, 인건비, 유지보수비 등 비용 구조 분석",
        "재무 분석 - 손익분기점, 투자회수기간, 수익률 계산",
        "10년 성장 시나리오 - 보수적/중립적/낙관적 시나리오별 수익 전망"
      ],
      "end_goal": "다중 수익원 구조가 설계되고 재무 분석이 완료되어 지속가능한 수익 모델이 제시됩니다",
      "narrowing": {
        "output_format": "수익 모델 설계 보고서, 수익원별 매출 추정표, 비용 구조 분석표, 재무 분석표(손익분기점, 투자회수기간, 수익률), 10년 성장 시나리오표를 포함한 종합 보고서. AI가 프로젝트 특성에 맞게 구조와 내용을 자유롭게 구성할 수 있습니다.",
        "revenue_streams": [
          "학비 (국제학교 200명 × 월 XXX만원)",
          "기숙사비 (200명 × 월 XXX만원)",
          "전지훈련 유치 (연간 XX팀 × 1주일)",
          "호텔/컨벤션 (200실 × 객실단가 × 연간 가동률)",
          "재활센터 (일반 환자 유치)",
          "시설 대관 (주민/생활체육)",
          "IP/라이선싱 (브랜드, 콘텐츠)"
        ],
        "scenarios": [
          "보수적 시나리오",
          "중립적 시나리오",
          "낙관적 시나리오"
        ],
        "constraints": "현실적인 단가와 이용률 추정, 계절별 변동성 고려",
        "quality_standards": "각 수익원별 구체적 매출 추정 근거를 제시하고, 재무 분석 상세 계산 과정과 10년 시나리오를 정량적으로 제시. AI가 프로젝트 특성에 맞게 적절한 분량과 깊이로 분석."
      },
      "category": "사업성 & 운영 전략"
    },
    {
      "id": "operational_efficiency_strategy",
      "name": "운영 효율화 전략",
      "description": "비수기 수익 감소 문제를 해결하기 위한 운영 전략을 수립하고 시뮬레이션 기반 최적화를 수행합니다",
      "role": "운영 전략 전문가로서 시설 운영 효율을 극대화하고 계절별 수익 변동성을 완화하는 전략을 수립하는 역할을 수행합니다",
      "instructions": "비수기(9-2월) 수익 감소 문제를 해결하기 위한 운영 전략을 수립하고, 실내 시설 활용, 겨울 스포츠 연계, 재활/웰니스 통년 수요, 국제 전지훈련 유치 등 다양한 전략을 제시합니다",
      "steps": [
        "비수기 문제 분석 - 여름 집중과 겨울철 시설 유휴화 문제 분석",
        "운영 전략 수립 - 실내 시설 활용, 겨울 스포츠 연계, 재활/웰니스 통년 수요, 국제 전지훈련 유치 등 5가지 전략 제시",
        "전략별 실행 방안 - 각 전략의 구체적 실행 방안과 필요 시설/인력 분석",
        "수익 기여도 추정 - 각 전략별 예상 수익 기여도와 실행 우선순위 제시",
        "시뮬레이션 기반 최적화 - 계절별 운영 전략 시뮬레이션 및 최적 조합 제시"
      ],
      "end_goal": "비수기 수익 감소 문제를 해결할 수 있는 구체적이고 실행 가능한 운영 전략이 제시되고, 시뮬레이션 기반 최적화가 완료됩니다",
      "narrowing": {
        "output_format": "운영 효율화 전략 보고서, 비수기 문제 분석표, 운영 전략표, 전략별 실행 방안표, 수익 기여도 추정표, 시뮬레이션 결과표를 포함한 종합 보고서. AI가 프로젝트 특성에 맞게 구조와 내용을 자유롭게 구성할 수 있습니다.",
        "strategies": [
          "실내 시설 활용 극대화",
          "겨울 스포츠 연계 (강원도 특성)",
          "재활/웰니스 통년 수요",
          "국제 전지훈련 유치 (남반구 팀)",
          "시설 다목적 활용"
        ],
        "strategy_elements": [
          "구체적 실행 방안",
          "필요 시설/인력",
          "예상 수익 기여도",
          "실행 우선순위"
        ],
        "constraints": "현실적이고 실행 가능한 전략 제시",
        "quality_standards": "각 전략별 구체적 실행 방안을 제시하고, 수익 기여도를 정량적으로 추정하며 시뮬레이션 결과를 포함. AI가 프로젝트 특성에 맞게 적절한 분량과 깊이로 분석."
      },
      "category": "사업성 & 운영 전략"
    },
    {
      "id": "customer_journey_mapping",
      "name": "고객 여정 맵핑",
      "description": "핵심 사용자 페르소나의 여정을 디자인하고 접점별 경험을 설계합니다",
      "role": "서비스 디자인 및 고객 경험 전문가로서 사용자의 전체 여정을 분석하고 최적의 경험을 설계하는 역할을 수행합니다",
      "instructions": "핵심 사용자 페르소나의 아카데미 방문 여정을 사전 접촉, 현장 방문, 사후 관리 단계로 나누어 분석하고, 각 단계별 제공 서비스, 필요 공간, 차별화 요소를 정리합니다",
      "steps": [
        "여정 단계 구분 - 사전 접촉, 현장 방문, 사후 관리 등 주요 여정 단계 구분",
        "접점별 경험 설계 - 각 단계별 터치포인트와 사용자 경험 설계",
        "필요 공간 및 서비스 식별 - 각 단계별 필요한 공간과 제공 서비스 식별",
        "차별화 포인트 발굴 - 경쟁사 대비 차별화 요소와 경쟁 우위 포인트 제시",
        "여정 맵 시각화 - 전체 여정을 표 형식으로 정리하여 시각화"
      ],
      "end_goal": "핵심 사용자 그룹의 전체 여정이 설계되고, 각 접점별 최적 경험이 제시되어 서비스 운영 전략의 기초가 마련됩니다",
      "narrowing": {
        "output_format": "고객 여정 맵 보고서, 여정 단계별 분석표, 접점별 경험 설계표, 필요 공간 및 서비스표, 차별화 포인트표를 포함한 종합 보고서. AI가 프로젝트 특성에 맞게 구조와 내용을 자유롭게 구성할 수 있습니다.",
        "journey_stages": [
          "1단계: 사전 접촉 (온라인 플랫폼, 데이터 분석 리포트, 방문 일정 예약)",
          "2단계: 현장 방문 (공항 픽업, 호텔 체크인, 환영 미팅, 훈련 참관, 재활/과학 시설 투어)",
          "3단계: 사후 관리 (지속적 선수 정보 업데이트, 화상 미팅 지원, 스카우팅 성사 시 파트너십)"
        ],
        "persona_example": "해외 대학 스카우트",
        "touchpoints": [
          "온라인 플랫폼",
          "공항 픽업",
          "호텔 체크인",
          "환영 미팅",
          "훈련 참관",
          "시설 투어",
          "사후 관리"
        ],
        "constraints": "현실적이고 실행 가능한 여정 설계",
        "quality_standards": "각 단계별 구체적 경험 설계를 제시하고, 필요 공간 및 서비스를 명시하며 차별화 포인트를 상세히 설명. AI가 프로젝트 특성에 맞게 적절한 분량과 깊이로 분석."
      },
      "category": "사용자 경험 & 스토리텔링"
    }
  ]
}